import React ,{useContext,useEffect}from 'react'
import { DispatchContext } from '../provider/app.provider'
import { Link as LinkDom } from 'react-router-dom'
import { Typography ,Divider} from 'antd'

type Props = {
    loading: boolean
}

const { Title, Paragraph, Text ,Link } = Typography;

export const LottoInfoPage = (props: Props) => {
    const { loading } = props
    const dispatch = useContext(DispatchContext)
    const [ellipsis, setEllipsis] = React.useState(true);

    useEffect(() => {
        dispatch && dispatch({type: 'showHead',showComponent: false})
    },[])

    return (
        <div style={{ padding: '15px',backgroundColor: '#00703c' }}>
           
            <LinkDom to={'/thank'} style={{ fontSize: '24px' , textDecoration: 'underline' ,color:  '#d8df7d'}}>ย้อนกลับ</LinkDom>
            <Typography style={{color: 'white'}}>
                            <Title>Term and Conditions</Title>
                            <Paragraph ellipsis={ellipsis}>
                                <p>ระยะเวลา : 24 กุมภาพันธ์ 2564 – 15 เมษายน 2564</p>
                            </Paragraph>

                            <Title>รางวัล</Title>
                            <Paragraph>
                            <b>รางวัลในการจับรางวัล ครั้งที่ 1 – 6 คือ</b>
                            </Paragraph>
                            <Paragraph>
                                <p><b>รางวัลที่ 1</b> ทองคำแท่งเลเซอร์ตรา เดอะ พิซซ่า คอมปะนี มูลค่า 10 บาท จำนวน 1 รางวัล </p>
                                <p>รางวัลละ 261,750 บาท รวมมูลค่า 261,750 บาท</p>
                            </Paragraph>

                            <Paragraph>
                                <p><b>รางวัลที่ 2</b> ทองคำแท่งเลเซอร์ตรา เดอะ พิซซ่า คอมปะนี มูลค่า 1 บาท จำนวน 10 รางวัล </p>
                                <div>
                                <p>รางวัลละ 26,850 บาท รวมมูลค่า 268,500 บาท<br/>
                                รวมของรางวัล 66 รางวัล รวมมูลค่า 3,181,500 บาท</p>
                                </div>
                            </Paragraph>

                            <Paragraph>
                            <b>รางวัลในการจับรางวัล ครั้งที่ 7  คือ</b>
                            </Paragraph>
                            <Paragraph>
                                <p><b>รางวัลที่ 1</b> ทองคำแท่งเลเซอร์ตรา เดอะ พิซซ่า คอมปะนี มูลค่า 40 บาท จำนวน 1 รางวัล </p>
                                <p>รางวัลละ 1,045,200 บาท รวมมูลค่า 1,045,200 บาท</p>
                            </Paragraph>
                            <Paragraph>
                                <p><b>รางวัลที่ 2</b>ทองคำแท่งเลเซอร์ตรา เดอะ พิซซ่า คอมปะนี มูลค่า 10 บาท จำนวน 2 รางวัล</p>
                                <div>
                                <p>รางวัลละ 261,750 บาท รวมมูลค่า 523,500 บาท</p>
                                </div>
                            </Paragraph>
                            <Paragraph>
                                <p><b>รางวัลที่ 3</b>ทองคำแท่งเลเซอร์ตรา เดอะ พิซซ่า คอมปะนี มูลค่า 5 บาท จำนวน 2 รางวัล </p>
                                <div>
                                <p>รางวัลละ 131,050 บาท รวมมูลค่า 262,100 บาท</p>
                                </div>
                            </Paragraph>
                            <Paragraph>
                                <p><b>รางวัลที่ 4</b>ทองคำแท่งเลเซอร์ตรา เดอะ พิซซ่า คอมปะนี มูลค่า 1 บาท จำนวน 10 รางวัล  </p>
                                <div>
                                <p>รางวัลละ 26,850 บาท รวมมูลค่า 268,500 บาท<br/>
                                รวมของรางวัล 15 รางวัล รวมมูลค่า 2,099,300 บาท</p>
                                </div>
                            </Paragraph>
                            <Paragraph>
                                <p>รวมของรางวัลทั้งสิ้นตลอดรายการ 81  รางวัล รวมมูลค่า 5,280,800 บาท</p>
                            </Paragraph>

                            <Divider />
                            <Title>วิธีการร่วมกิจกรรม</Title>
                            <Paragraph>
                                <p>ผู้ร่วมกิจกรรมกรอกข้อมูลตามที่ระบบกำหนด (ชื่อ-นามสกุล, </p>
                                <p>เลขที่บัตรประชาชน, เบอร์มือถือ,อีเมล,รหัสร่วมลุ้นโชค,เลขที่ </p>
                                <p>ใบเสร็จ,วันที่ซื้อสินค้า) ผ่านระบบ <b>Line official Account : </b></p>
                                <p>เดอะพิซซ่า คอมปะนี <b>(@ThePizzaCompany)</b> </p>
                            </Paragraph>
                            <Title>หมายเหตุ :</Title>
                            <Paragraph>
                                <p>เฉพาะซื้อพิซซ่าในรายการโปรโมชั่น 1 แถม 1 ทุก </p>
                                <p>หน้า ทุกขอบ ที่ร้านเดอะ พิซซ่า คอมปะนี หรือช่องทางการขาย</p>
                                <p>อื่นของ เดอะ พิซซ่า คอมปะนี เช่น เว็ปไซต์  แอปพลิเคชั่น  หรือ </p>
                                <p>สั่งซื้อทางโทรศัพท์ 1112 หรือแอปพลิเคชั่น 1112 เดลิเวอรี่ เริ่ม </p>
                                <p>รายการตั้งแต่ 24 กุมภาพันธ์ 2564-วันที่ 15 เมษายน 2564 </p>
                                <p>รหัสหมายเลขใน 1 ใบเสร็จ จะถือว่าคือ 1 สิทธิ์ หรือ 1 ชิ้นส่วน</p>
                            </Paragraph>

                            <Divider />
                            <Title>กำหนดจับรางวัล</Title>
                            <Paragraph>
                                <p>ณ ร้านเดอะพิซซ่า คอมปะนี สาขาอิมแพค เมืองทองธานี เลขที่ </p>
                                <p>92 ถนนป๊อปปูล่า แขวงบ้านใหม่ อำเภอปากเกร็ด จังหวัด</p>
                                <p>นนทบุรี 11120</p>
                                <br/>
                                <p>โดยมีกำหนดจับรางวัล 7 ครั้ง ดังนี้</p>
                                <p><b>ครั้งที่ 1</b> วันที่ 24 กุมภาพันธ์ 2564 – วันที่ 2 มีนาคม 2564</p>
                                <p>จับรางวัลวันที่ 5 มีนาคม 2564</p>
                                <p><b>ครั้งที่ 2</b> วันที่ 3 มีนาคม 2564 – วันที่ 9 มีนาคม 2564</p>
                                <p>จับรางวัลวันที่ 12 มีนาคม 2564</p>
                                <p><b>ครั้งที่ 3</b> วันที่ 10 มีนาคม 2564 – วันที่ 16 มีนาคม 2564</p>
                                <p>จับรางวัลวันที่ 19 มีนาคม 2564</p>
                                <p><b>ครั้งที่ 4</b> วันที่ 17 มีนาคม 2564 – วันที่ 23 มีนาคม 2564</p>
                                <p>จับรางวัลวันที่ 26 มีนาคม 2564</p>
                                <p><b>ครั้งที่ 5</b> วันที่ 24 มีนาคม 2564 – วันที่ 30 มีนาคม 2564</p>
                                <p>จับรางวัลวันที่ 2 เมษายน 2564</p>
                                <p><b>ครั้งที่ 6</b> วันที่ 31 มีนาคม 2564 – วันที่ 6 เมษายน 2564</p>
                                <p>จับรางวัลวันที่ 9 เมษายน 2564 </p>
                                <p><b>ครั้งที่ 7</b> วันที่ 24 กุมภาพันธ์ 2564 – วันที่ 15 เมษายน 2564</p>
                                <p>จับรางวัลวันที่ 20 เมษายน 2564</p>
                                <p><b>หมายเหตุ : </b>ชิ้นส่วนที่เหลือจากการจับรางวัล</p>
                                <p>ในครั้งที่ 1 – 6  จะถูกนำมาจับในครั้งที่ 7</p>
                            </Paragraph>

                            <Title>วิธีประกาศรางวัล</Title>
                            <Paragraph>
                                <p>ประกาศรายชื่อผู้โชคดีทาง </p>
                                <p><b>Facebook The Pizza Company 1112</b></p>
                                <p><Link href="https://www.facebook.com/thepizzacompany" target="_blank">
                                https://www.facebook.com/thepizzacompany</Link> และ</p>
                                <p>LINE Official account ThePizzaCompany1112</p>
                                <p><Link href="https://page.line.me/thepizzacompany" target="_blank">
                                https://page.line.me/thepizzacompany</Link> ดังนี้</p> 

                                <p>ครั้งที่ 1 วันที่ 5 มีนาคม 2564 เวลา 14.00 น.</p>
                                <p>ครั้งที่ 2 วันที่ 12 มีนาคม 2564 เวลา 14.00 น.</p>
                                <p>ครั้งที่ 3 วันที่ 19 มีนาคม 2564 เวลา 14.00 น.</p>
                                <p>ครั้งที่ 4 วันที่ 26 มีนาคม 2564 เวลา 14.00 น.</p>
                                <p>ครั้งที่ 5 วันที่ 2 เมษายน 2564 เวลา 14.00 น.</p>
                                <p>ครั้งที่ 6 วันที่ 9 เมษายน 2564 เวลา 14.00 น.</p>
                                <p>ครั้งที่ 7 วันที่ 20 เมษายน 2564 เวลา 14.00 น.</p>
                            </Paragraph>

                            <Divider />
                            <Title>การรับรางวัล</Title>
                            <Paragraph>
                                <p><b>1.</b> ผู้ร่วมกิจกรรมจะต้องปฏิบัติตามวิธีการเข้าร่วมกิจกรรม.</p>
                                <p>อย่างครบถ้วนเท่านั้น</p>
                                <p><b>2.</b> ทางบริษัทฯ จะทำการติดต่อผู้ที่ได้รับรางวัลกลับไป ทาง</p>
                                <p>เบอร์ติดต่อที่ได้ทำการระบุไว้ในขั้นตอนลงทะเบียน </p>
                                <p>ภายใน 3 วันนับตั้งแต่วันที่ประกาศรางวัล  โดยผู้ที่ได้รับ </p>
                                <p>การติดต่อมีความจำเป็นที่จะยืนยันตัวตนด้วย ชื่อ ที่อยู่ และ</p>
                                <p>เลขบัตรประจำตัวประชาชนสำหรับการรับมอบของรางวัล</p>
                                <p><b>3.</b> สำหรับผู้โชคดีที่ไม่สามารถติดต่อได้ ทางบริษัทฯ ขอสงวน</p>
                                <p>สิทธิ์นั้นให้กับผู้รับรางวัลท่านอื่นในลำดับต่อไป </p>
                                <p><b>4.</b> เจ้าหน้าที่จะแจ้งรายละเอียดทางอีเมลหรือทางโทรศัพท์ของ</p>
                                <p>ท่าน สำหรับผู้โชคดีที่ได้รับรางวัลที่มีมูลค่าตั้งแต่ 1,000 บาท </p>
                                <p>ต้องชำระภาษีหัก ณ ที่จ่าย 5% ตามมูลค่าของรางวัล </p>
                                <p>ชำระผ่านบัญชีธนาคารให้กับบริษัทเดอะ ไมเนอร์ ฟู้ด กรุ๊ป </p>
                                <p>จำกัด (มหาชน) หากลูกค้าไม่ได้ชำระภาษี หรือแจ้ง</p>
                                <p>หลักฐานตามเงื่อนไขภายในวัน เวลา ที่บริษัทกำหนด ถือ</p>
                                <p>ว่าผู้โชคดีสละสิทธิ์ ไม่ขอรับรางวัลใดๆ ทั้งสิ้น</p>
                                <p><b>5.</b> แสดงหลักฐานใบเสร็จค่าอาหารที่ตรงกับรหัสที่ได้รับรางวัล</p>
                                <p>,สำเนาบัตรประชาชน,ทะเบียนบ้าน,สำเนาการโอนค่าหัก</p>
                                <p>ภาษี ณ ที่จ่าย ในวันที่ติดต่อรับรางวัล</p>
                            </Paragraph>

                            <Divider />
                            <Title>กติกาการร่วมกิจกรรม</Title>
                            <Paragraph>
                                <p><b>1.</b> กิจกรรมนี้เริ่มตั้งแต่วันที่ 24 กุมภาพันธ์ 2564 ถึงวันที่ 15</p>
                                <p>เมษายน 2564</p>
                                <p><b>2.</b> บริษัท เดอะ ไมเนอร์ ฟู้ด กรุ๊ป จำกัด (มหาชน) (“บริษัทฯ”)</p>
                                <p>จะนำรายชื่อผู้เข้าร่วมกิจกรรมที่เข้าร่วมกิจกรรมตามเงื่อนไขมา </p>
                                <p>พิมพ์เป็นสลาก และทำการจับรางวัล ณ วัน-เวลา และสถานที่ที่</p>
                                <p>บริษัทฯ กำหนด</p>
                                <p><b>3.</b> บริษัทฯ ขอสงวนสิทธิในการตัดสิทธิผู้ร่วมกิจกรรมโดยไม่</p>
                                <p>ต้องแจ้งให้ทราบล่วงหน้า ในกรณีที่บริษัทฯ ตรวจสอบพบว่ามี</p>
                                <p>การกระทำใดๆ ที่เข้าข่ายทุจริตหรือผิดวัตถุประสงค์ของกิจกรรม</p>
                                <p><b>4.</b> บริษัทฯ จะไม่รับผิดชอบต่อการสูญหาย หรือการถูก</p>
                                <p>โจรกรรมข้อมูลของผู้ร่วมกิจกรรม อันเนื่องจากปัญหาของระบบ</p>
                                <p>เทคนิค หรือการกระทำผิดของบุคคลที่สาม</p>
                                <p><b>5.</b> ผู้โชคดี 1 ท่านมีสิทธิ์ได้รับรางวัลเพียง 1 รางวัลตลอด</p>
                                <p>รายการเท่านั้น</p>
                                <p><b>6.</b> ผู้โชคดีต้องชำระภาษีเงินได้หัก ณ ที่จ่าย จากมูลค่าของ</p>
                                <p>รางวัลตามคำสั่งกรมสรรพากร </p>
                                <p><b>7.</b> ได้รับรางวัลไม่สามารถโอนสิทธิการรับรางวัลให้กับผู้อื่นได้</p>
                                <p>และไม่สามารถเปลี่ยนแปลงของรางวัลเป็นเงินสดได้</p>
                                <p><b>8.</b> ผู้ได้รับรางวัลอนุญาตให้บริษัทฯ ใช้และ/หรือให้ตัวแทน</p>
                                <p>ของบริษัทฯ ใช้ชื่อ ภาพ หรือข้อความในสื่อโฆษณา </p>
                                <p>ประชาสัมพันธ์การตลาดได้ </p>
                                <p><b>9.</b> พนักงานของบริษัทเดอะ ไมเนอร์ ฟู้ด กรุ๊ป จำกัด (มหาชน)</p>
                                <p>และบริษัทอื่นที่เกี่ยวข้องในกิจกรรมดังกล่าว รวมถึงครอบครัว </p>
                                <p>ไม่สามารถร่วมกิจกรรมนี้ได้</p>
                                <p><b>10.</b> การตัดสินของคณะกรรมการถือเป็นที่สิ้นสุดในทุกกรณี</p>
                                <p><b>11.</b> ผู้เข้าร่วมกิจกรรมได้ทำความเข้าใจเงื่อนไขของกิจกรรม</p>
                                <p>เรียบร้อย และยินยอมที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขที่</p>
                                <p>ระบุไว้ข้างต้นทุกประการ</p>
                                <p><b>12.</b> ผู้เข้าร่วมรายการยินยอมรับข้อมูลข่าวสาร กิจกรรมส่งเสริม</p>
                                <p>การขายต่างๆ จากเดอะ พิซซ่า คอมปะนี และ บริษัทในเครือ</p>
                                <p>โดยเราจะเก็บข้อมูลของท่านไว้เป็น  ความลับ สามารถศึกษา</p>
                                <p>เงื่อนไข/ข้อตกลง นโยบายความเป็นส่วนตัว เพิ่มเติมได้ที่</p>
                                <p>เว็บไซต์ของบริษัท</p>
                                <p><b>13.</b> ใบอนุญาตเลขที่ 48-54/2564 ออกให้ ณ ที่ว่าการอำเภอปากเกร็ด</p>
                            </Paragraph>

                            <Divider/>
                            <Paragraph>
                                <p>**กิจกรรมดังกล่าวถือว่าผู้เข้าร่วมรายการได้อ่าน  สอบถาม และ</p>
                                <p>เข้าใจเงื่อนไขวิธีการเล่น  สิ่งของรางวัล และรายละเอียดเพิ่มเติม</p>
                                <p>แล้วจึงเข้าร่วมรายการส่งเสริมการขายในครั้งนี้*</p>
                            </Paragraph>
             </Typography>
      
        </div>
            
    )
}